In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("StudentDetails_2022-2023_BACHELOR OF SCIENCE _ INFORMATION TECHNOLOGY - 1.xlsx")

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df.head() # it will give 1st five record

,StudentId,StudentNameWithMotherName,StudentNumber,RegistrationId,EnrollmentNumber,RollNumber,Prn no
0,3924705,ABHANG PRANAY SHASHIKANT SUVARNA,4453,1334404,22071002,229001,2022016401586151
1,4259073,ACHARY ARJUN GOPALAKRISHNAN SUNIMOL,4949,1161702,22071151,229179,2022016401597616
2,3920578,ADEP VAMSHI VARAIAH PADMA,4419,1329568,22071003,229002,2022016401600516
3,3882827,AIWALE SWAPNIL RAGHU JAYSHREE,4071,1219147,22071004,229003,2022016401595173
4,3835941,AMANCHA SNEHA ANJANEYULU RAMADEVI,3677,1286619,22071005,229004,2022016401590535

In [5]:
df.head(3) #also you can select data

,StudentId,StudentNameWithMotherName,StudentNumber,RegistrationId,EnrollmentNumber,RollNumber,Prn no
0,3924705,ABHANG PRANAY SHASHIKANT SUVARNA,4453,1334404,22071002,229001,2022016401586151
1,4259073,ACHARY ARJUN GOPALAKRISHNAN SUNIMOL,4949,1161702,22071151,229179,2022016401597616
2,3920578,ADEP VAMSHI VARAIAH PADMA,4419,1329568,22071003,229002,2022016401600516

In [6]:
df.tail() # return last five record default

,StudentId,StudentNameWithMotherName,StudentNumber,RegistrationId,EnrollmentNumber,RollNumber,Prn no
135,3873260,YADAV MANISHA SURESH JAIDEVI,3940,1304880,22071130,229157,2022016401605765
136,3890175,YADAV NITU DEVMUNI MIRA,4176,1228600,22071131,229158,2022016401609593
137,3829884,YADAV PINKI SATYANARAYAN SUGI,3586,1279757,22071132,229159,2022016401605966
138,3918303,YADAV SACHIN SANTOSH POONAM,4364,1221210,22071133,229160,2022016401608214
139,3882825,YADAV SURAJ RAMSAMUJH NIRMALA,4069,1205029,22071134,229161,2022016401594765

In [7]:
df.tail(6) # also you can select data

,StudentId,StudentNameWithMotherName,StudentNumber,RegistrationId,EnrollmentNumber,RollNumber,Prn no
134,3889417,YADAV LAXMI CHANDRIKA NAGESHWARIDEVI,4166,1142868,22071129,229156,2022016401609016
135,3873260,YADAV MANISHA SURESH JAIDEVI,3940,1304880,22071130,229157,2022016401605765
136,3890175,YADAV NITU DEVMUNI MIRA,4176,1228600,22071131,229158,2022016401609593
137,3829884,YADAV PINKI SATYANARAYAN SUGI,3586,1279757,22071132,229159,2022016401605966
138,3918303,YADAV SACHIN SANTOSH POONAM,4364,1221210,22071133,229160,2022016401608214
139,3882825,YADAV SURAJ RAMSAMUJH NIRMALA,4069,1205029,22071134,229161,2022016401594765

In [8]:
df.columns # return all columns

Index(['StudentId', 'StudentNameWithMotherName', 'StudentNumber',
       'RegistrationId', 'EnrollmentNumber', 'RollNumber', 'Prn no'],
      dtype='object')

In [9]:
list(df.columns)

['StudentId',
 'StudentNameWithMotherName',
 'StudentNumber',
 'RegistrationId',
 'EnrollmentNumber',
 'RollNumber',
 'Prn no']

In [10]:
df['StudentNameWithMotherName'] # it gives you single column record

0         ABHANG PRANAY SHASHIKANT SUVARNA
1      ACHARY ARJUN GOPALAKRISHNAN SUNIMOL
2                ADEP VAMSHI VARAIAH PADMA
3            AIWALE SWAPNIL RAGHU JAYSHREE
4        AMANCHA SNEHA ANJANEYULU RAMADEVI
                      ...
135           YADAV MANISHA SURESH JAIDEVI
136                YADAV NITU DEVMUNI MIRA
137          YADAV PINKI SATYANARAYAN SUGI
138            YADAV SACHIN SANTOSH POONAM
139          YADAV SURAJ RAMSAMUJH NIRMALA
Name: StudentNameWithMotherName, Length: 140, dtype: object

In [11]:
type(df['StudentNameWithMotherName']) # single row or column data is know as series

pandas.core.series.Series

In [12]:
df[['StudentId','StudentNameWithMotherName','StudentNumber']] # in list it gives you multiple records of columns

     StudentId            StudentNameWithMotherName  StudentNumber
0      3924705     ABHANG PRANAY SHASHIKANT SUVARNA           4453
1      4259073  ACHARY ARJUN GOPALAKRISHNAN SUNIMOL           4949
2      3920578            ADEP VAMSHI VARAIAH PADMA           4419
3      3882827        AIWALE SWAPNIL RAGHU JAYSHREE           4071
4      3835941    AMANCHA SNEHA ANJANEYULU RAMADEVI           3677
..         ...                                  ...            ...
135    3873260         YADAV MANISHA SURESH JAIDEVI           3940
136    3890175              YADAV NITU DEVMUNI MIRA           4176
137    3829884        YADAV PINKI SATYANARAYAN SUGI           3586
138    3918303          YADAV SACHIN SANTOSH POONAM           4364
139    3882825        YADAV SURAJ RAMSAMUJH NIRMALA           4069

[140 rows x 3 columns]

In [13]:
df[['StudentNameWithMotherName']]

               StudentNameWithMotherName
0       ABHANG PRANAY SHASHIKANT SUVARNA
1    ACHARY ARJUN GOPALAKRISHNAN SUNIMOL
2              ADEP VAMSHI VARAIAH PADMA
3          AIWALE SWAPNIL RAGHU JAYSHREE
4      AMANCHA SNEHA ANJANEYULU RAMADEVI
..                                   ...
135         YADAV MANISHA SURESH JAIDEVI
136              YADAV NITU DEVMUNI MIRA
137        YADAV PINKI SATYANARAYAN SUGI
138          YADAV SACHIN SANTOSH POONAM
139        YADAV SURAJ RAMSAMUJH NIRMALA

[140 rows x 1 columns]

In [14]:
type(df[['StudentNameWithMotherName']])

pandas.core.frame.DataFrame

In [15]:
df[['StudentNameWithMotherName']].head()

             StudentNameWithMotherName
0     ABHANG PRANAY SHASHIKANT SUVARNA
1  ACHARY ARJUN GOPALAKRISHNAN SUNIMOL
2            ADEP VAMSHI VARAIAH PADMA
3        AIWALE SWAPNIL RAGHU JAYSHREE
4    AMANCHA SNEHA ANJANEYULU RAMADEVI

In [16]:
df.dtypes # it gives data type of columns

StudentId                     int64
StudentNameWithMotherName    object
StudentNumber                 int64
RegistrationId                int64
EnrollmentNumber              int64
RollNumber                    int64
Prn no                        int64
dtype: object

In [17]:
df.to_csv("std_details.csv",index = False) # to save file